In [1]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\d e l l\appdata\roaming\python\python312\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\d e l l\appdata\roaming\python\python312\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\d e l l\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\d e l l\appdata\roaming\python\python312\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\d e l l\appdata\roaming\python\python312\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\d e l l\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [4]:
# create series and one diamensional array  
data=[1,2,3,4,5,6]
series=pd.Series(data)
print("series \n",series)
print(type(series))

series
 0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
# create series  from dictionary 
data={'a':1,'b':2,'c':3,'d':4,'e':5}
dict_series=pd.Series(data)
print(dict_series)
print(type(dict_series))

a    1
b    2
c    3
d    4
e    5
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
data=[10,20,30,40,50,60]
index=['a','b','c','d','e','f']
pd.Series(data,index)

a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

In [ ]:
#Dataframe is 2-D using dictionaries 
data={
    'Name':['keYUR','ansh','john'],
    'age':[25,20,30],
    'city':['surat','baroda','rajkot']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  age    city
0  keYUR   25   surat
1   ansh   20  baroda
2   john   30  rajkot
<class 'pandas.core.frame.DataFrame'>

In [14]:
import numpy as np 
ar=np.array(data)
print(ar)
print(type(ar))
print(ar.ndim)

{'Name': ['keYUR', 'ansh', 'john'], 'age': [25, 20, 30], 'city': ['surat', 'baroda', 'rajkot']}
<class 'numpy.ndarray'>
0

In [17]:
# create list of Dictionaries

data=[
    {'name':'john','age':32,'city':'bardoli'},
    {'name':'disk','age':30,'city':'anand'},
    {'name':'jack','age':34,'city':'navsari'},
    {'name':'wick','age':10,'city':'surat'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

   name  age     city
0  john   32  bardoli
1  disk   30    anand
2  jack   34  navsari
3  wick   10    surat
<class 'pandas.core.frame.DataFrame'>

In [21]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [22]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [23]:
## accessing data from dataframe
data=[
    {'name':'john','age':32,'city':'bardoli'},
    {'name':'disk','age':30,'city':'anand'},
    {'name':'jack','age':34,'city':'navsari'},
    {'name':'wick','age':10,'city':'surat'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

   name  age     city
0  john   32  bardoli
1  disk   30    anand
2  jack   34  navsari
3  wick   10    surat
<class 'pandas.core.frame.DataFrame'>

In [24]:
df['name']

0    john
1    disk
2    jack
3    wick
Name: name, dtype: object

In [25]:
type(df['name'])

pandas.core.series.Series

In [27]:
df.loc[0]
#df.loc[2]

name       john
age          32
city    bardoli
Name: 0, dtype: object

In [28]:
df.iloc[0]

name       john
age          32
city    bardoli
Name: 0, dtype: object

In [31]:
df.iloc[0][2]

C:\Users\D E L L\AppData\Local\Temp\ipykernel_13216\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'bardoli'

In [32]:
df

   name  age     city
0  john   32  bardoli
1  disk   30    anand
2  jack   34  navsari
3  wick   10    surat

In [33]:
## Specified element can accessing using index
df.at[1,'age']

30

In [34]:
df.at[2,'city']

'navsari'

In [37]:
#usind specified element 
df.iat[1,2]

'anand'

In [38]:
df

   name  age     city
0  john   32  bardoli
1  disk   30    anand
2  jack   34  navsari
3  wick   10    surat

In [39]:
#adding and remove a columns
df['salary']=[10000,20000,20004,40000]
df

   name  age     city  salary
0  john   32  bardoli   10000
1  disk   30    anand   20000
2  jack   34  navsari   20004
3  wick   10    surat   40000

In [ ]:
df.drop('salary',axis=1)

   name  age     city
0  john   32  bardoli
1  disk   30    anand
2  jack   34  navsari
3  wick   10    surat

In [43]:
df

   name  age     city  salary
0  john   32  bardoli   10000
1  disk   30    anand   20000
2  jack   34  navsari   20004
3  wick   10    surat   40000

In [45]:
df.drop('salary',axis=1,inplace=True)

In [46]:
df

   name  age     city
0  john   32  bardoli
1  disk   30    anand
2  jack   34  navsari
3  wick   10    surat

In [ ]:
# change and manipulate data with same cols 
df['age']=df.iloc[1,1]+1

In [48]:
df

   name  age     city
0  john   31  bardoli
1  disk   31    anand
2  jack   31  navsari
3  wick   31    surat

In [50]:
df.iloc[1,1]=df.[1,1]+1

SyntaxError: invalid syntax (4238744426.py, line 1)

In [51]:
df

   name  age     city
0  john   31  bardoli
1  disk   31    anand
2  jack   31  navsari
3  wick   31    surat

In [ ]:
# ADDING every columns in same data
df['age']=df['age']+2
df

   name  age     city
0  john   33  bardoli
1  disk   33    anand
2  jack   33  navsari
3  wick   33    surat

In [53]:
df.drop(3,inplace=True)

In [54]:
df

   name  age     city
0  john   33  bardoli
1  disk   33    anand
2  jack   33  navsari

In [55]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [56]:
# statical analiysis
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000